tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_SRC_GENERAL.h
#define SRC_GENERAL_AUTHEN_CTRL_LOCK_TZ_MASK     (0x800U)
#define SRC_GENERAL_AUTHEN_CTRL_LOCK_TZ_SHIFT    (11U)
/*! LOCK_TZ - Lock Trust Zone Non Secure(TZ_NS) and Trust Zone User(TZ_USER) bits
 *  0b0..TZ_NS and TZ_USER values can be changed.
 *  0b1..LOCK_TZ, TZ_NS and TZ_USER values cannot be changed.
 */
#define SRC_GENERAL_AUTHEN_CTRL_LOCK_TZ(x)       (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_AUTHEN_CTRL_LOCK_TZ_SHIFT)) & SRC_GENERAL_AUTHEN_CTRL_LOCK_TZ_MASK)

#define SRC_GENERAL_AUTHEN_CTRL_LOCK_LIST_MASK   (0x8000U)
#define SRC_GENERAL_AUTHEN_CTRL_LOCK_LIST_SHIFT  (15U)
/*! LOCK_LIST - White list lock
 *  0b0..WHITE_LIST value can be changed.
 *  0b1..LOCK_LIST and WHITE_LIST values cannot be changed.
 */
#define SRC_GENERAL_AUTHEN_CTRL_LOCK_LIST(x)     (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_AUTHEN_CTRL_LOCK_LIST_SHIFT)) & SRC_GENERAL_AUTHEN_CTRL_LOCK_LIST_MASK)

#define SRC_GENERAL_AUTHEN_CTRL_WHITE_LIST_MASK  (0xFFFF0000U)
#define SRC_GENERAL_AUTHEN_CTRL_WHITE_LIST_SHIFT (16U)
/*! WHITE_LIST - Domain ID white list
 *  0b0000000000000001..Core with domain ID=0 can write General registers.
 *  0b0000000000000010..Core with domain ID=1 can write General registers.
 *  0b0000000000000100..Core with domain ID=2 can write General registers.
 *  0b0000000000001000..Core with domain ID=3 can write General registers.
 *  0b0000000000010000..Core with domain ID=4 can write General registers.
 *  0b0000000000100000..Core with domain ID=5 can write General registers.
 *  0b0000000001000000..Core with domain ID=6 can write General registers.
 *  0b0000000010000000..Core with domain ID=7 can write General registers.
 *  0b0000000100000000..Core with domain ID=8 can write General registers.
 *  0b0000001000000000..Core with domain ID=9 can write General registers.
 *  0b0000010000000000..Core with domain ID=10 can write General registers.
 *  0b0000100000000000..Core with domain ID=11 can write General registers.
 *  0b0001000000000000..Core with domain ID=12 can write General registers.
 *  0b0010000000000000..Core with domain ID=13 can write General registers.
 *  0b0100000000000000..Core with domain ID=14 can write General registers.
 *  0b1000000000000000..Core with domain ID=15 can write General registers.
 */
#define SRC_GENERAL_AUTHEN_CTRL_WHITE_LIST(x)    (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_AUTHEN_CTRL_WHITE_LIST_SHIFT)) & SRC_GENERAL_AUTHEN_CTRL_WHITE_LIST_MASK)
/*! @} */

/*! @name SCR - SRC Control Register */
/*! @{ */

#define SRC_GENERAL_SCR_BT_RELEASE_M7_MASK       (0x1U)
#define SRC_GENERAL_SCR_BT_RELEASE_M7_SHIFT      (0U)
/*! BT_RELEASE_M7 - Boot release M7
 *  0b0..Holds M7 Core reset.
 *  0b1..Releases M7 Core reset and let it run. After this bit is set, it cannot be cleared by SW write.
 */
#define SRC_GENERAL_SCR_BT_RELEASE_M7(x)         (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SCR_BT_RELEASE_M7_SHIFT)) & SRC_GENERAL_SCR_BT_RELEASE_M7_MASK)
/*! @} */

/*! @name SRTMR - SRC Reset Trigger Mode Register */
/*! @{ */

#define SRC_GENERAL_SRTMR_WDOG1_TRIG_MODE_MASK   (0x1U)
#define SRC_GENERAL_SRTMR_WDOG1_TRIG_MODE_SHIFT  (0U)
/*! WDOG1_TRIG_MODE - Wdog1 reset trigger mode configuration, locked by LOCK_CFG field
 *  0b0..Level-sensitive: System stays in reset until the reset source deasserts.
 *  0b1..Edge-sensitive: System resets once, even if the reset source remains asserted.
 */
#define SRC_GENERAL_SRTMR_WDOG1_TRIG_MODE(x)     (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRTMR_WDOG1_TRIG_MODE_SHIFT)) & SRC_GENERAL_SRTMR_WDOG1_TRIG_MODE_MASK)

#define SRC_GENERAL_SRTMR_WDOG2_TRIG_MODE_MASK   (0x2U)
#define SRC_GENERAL_SRTMR_WDOG2_TRIG_MODE_SHIFT  (1U)
/*! WDOG2_TRIG_MODE - Wdog2 reset trigger mode configuration, locked by LOCK_CFG field
 *  0b0..Level-sensitive: System stays in reset until the reset source deasserts.
 *  0b1..Edge-sensitive: System resets once, even if the reset source remains asserted.
 */
#define SRC_GENERAL_SRTMR_WDOG2_TRIG_MODE(x)     (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRTMR_WDOG2_TRIG_MODE_SHIFT)) & SRC_GENERAL_SRTMR_WDOG2_TRIG_MODE_MASK)

#define SRC_GENERAL_SRTMR_WDOG3_TRIG_MODE_MASK   (0x4U)
#define SRC_GENERAL_SRTMR_WDOG3_TRIG_MODE_SHIFT  (2U)
/*! WDOG3_TRIG_MODE - Wdog3 reset trigger mode configuration, locked by LOCK_CFG field
 *  0b0..Level-sensitive: System stays in reset until the reset source deasserts.
 *  0b1..Edge-sensitive: System resets once, even if the reset source remains asserted.
 */
#define SRC_GENERAL_SRTMR_WDOG3_TRIG_MODE(x)     (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRTMR_WDOG3_TRIG_MODE_SHIFT)) & SRC_GENERAL_SRTMR_WDOG3_TRIG_MODE_MASK)

#define SRC_GENERAL_SRTMR_WDOG4_TRIG_MODE_MASK   (0x8U)
#define SRC_GENERAL_SRTMR_WDOG4_TRIG_MODE_SHIFT  (3U)
/*! WDOG4_TRIG_MODE - Wdog4 reset trigger mode configuration, locked by LOCK_CFG field
 *  0b0..Level-sensitive: System stays in reset until the reset source deasserts.
 *  0b1..Edge-sensitive: System resets once, even if the reset source remains asserted.
 */
#define SRC_GENERAL_SRTMR_WDOG4_TRIG_MODE(x)     (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRTMR_WDOG4_TRIG_MODE_SHIFT)) & SRC_GENERAL_SRTMR_WDOG4_TRIG_MODE_MASK)

#define SRC_GENERAL_SRTMR_WDOG5_TRIG_MODE_MASK   (0x10U)
#define SRC_GENERAL_SRTMR_WDOG5_TRIG_MODE_SHIFT  (4U)
/*! WDOG5_TRIG_MODE - Wdog5 reset trigger mode configuration, locked by LOCK_CFG field
 *  0b0..Level-sensitive: System stays in reset until the reset source deasserts.
 *  0b1..Edge-sensitive: System resets once, even if the reset source remains asserted.
 */
#define SRC_GENERAL_SRTMR_WDOG5_TRIG_MODE(x)     (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRTMR_WDOG5_TRIG_MODE_SHIFT)) & SRC_GENERAL_SRTMR_WDOG5_TRIG_MODE_MASK)

#define SRC_GENERAL_SRTMR_TEMPSENSE_TRIG_MODE_MASK (0x20U)
#define SRC_GENERAL_SRTMR_TEMPSENSE_TRIG_MODE_SHIFT (5U)
/*! TEMPSENSE_TRIG_MODE - TempSense reset trigger mode configuration, locked by LOCK_CFG field
 *  0b0..Level-sensitive: System stays in reset until the reset source deasserts.
 *  0b1..Edge-sensitive: System resets once, even if the reset source remains asserted.
 */
#define SRC_GENERAL_SRTMR_TEMPSENSE_TRIG_MODE(x) (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRTMR_TEMPSENSE_TRIG_MODE_SHIFT)) & SRC_GENERAL_SRTMR_TEMPSENSE_TRIG_MODE_MASK)

#define SRC_GENERAL_SRTMR_EDGELOCK_TRIG_MODE_MASK (0x40U)
#define SRC_GENERAL_SRTMR_EDGELOCK_TRIG_MODE_SHIFT (6U)
/*! EDGELOCK_TRIG_MODE - Edgelock reset trigger mode configuration, locked by LOCK_CFG field
 *  0b0..Level-sensitive: System stays in reset until the reset source deasserts.
 *  0b1..Edge-sensitive: System resets once, even if the reset source remains asserted.
 */
#define SRC_GENERAL_SRTMR_EDGELOCK_TRIG_MODE(x)  (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRTMR_EDGELOCK_TRIG_MODE_SHIFT)) & SRC_GENERAL_SRTMR_EDGELOCK_TRIG_MODE_MASK)

