tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_SRC_GENERAL.h
#define SRC_GENERAL_SRMASK_EDGELOCK_MASK_MASK    (0x40U)
#define SRC_GENERAL_SRMASK_EDGELOCK_MASK_SHIFT   (6U)
/*! EDGELOCK_MASK - Edgelock reset mask
 *  0b0..The reset source can work
 *  0b1..The reset source is masked, cannot work
 */
#define SRC_GENERAL_SRMASK_EDGELOCK_MASK(x)      (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRMASK_EDGELOCK_MASK_SHIFT)) & SRC_GENERAL_SRMASK_EDGELOCK_MASK_MASK)

#define SRC_GENERAL_SRMASK_JTAGSW_MASK_MASK      (0x80U)
#define SRC_GENERAL_SRMASK_JTAGSW_MASK_SHIFT     (7U)
/*! JTAGSW_MASK - JTAGSW reset mask
 *  0b0..The reset source can work
 *  0b1..The reset source is masked, cannot work
 */
#define SRC_GENERAL_SRMASK_JTAGSW_MASK(x)        (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRMASK_JTAGSW_MASK_SHIFT)) & SRC_GENERAL_SRMASK_JTAGSW_MASK_MASK)

#define SRC_GENERAL_SRMASK_CM33_RESET_MASK_MASK  (0x100U)
#define SRC_GENERAL_SRMASK_CM33_RESET_MASK_SHIFT (8U)
/*! CM33_RESET_MASK - CM33 reset mask
 *  0b0..The reset source can work
 *  0b1..The reset source is masked, cannot work
 */
#define SRC_GENERAL_SRMASK_CM33_RESET_MASK(x)    (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRMASK_CM33_RESET_MASK_SHIFT)) & SRC_GENERAL_SRMASK_CM33_RESET_MASK_MASK)

#define SRC_GENERAL_SRMASK_CM33_LOCKUP_MASK_MASK (0x200U)
#define SRC_GENERAL_SRMASK_CM33_LOCKUP_MASK_SHIFT (9U)
/*! CM33_LOCKUP_MASK - CM33 lockup mask
 *  0b0..The reset source can work
 *  0b1..The reset source is masked, cannot work
 */
#define SRC_GENERAL_SRMASK_CM33_LOCKUP_MASK(x)   (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRMASK_CM33_LOCKUP_MASK_SHIFT)) & SRC_GENERAL_SRMASK_CM33_LOCKUP_MASK_MASK)

#define SRC_GENERAL_SRMASK_CM7_RESET_MASK_MASK   (0x400U)
#define SRC_GENERAL_SRMASK_CM7_RESET_MASK_SHIFT  (10U)
/*! CM7_RESET_MASK - CM7 reset mask
 *  0b0..The reset source can work
 *  0b1..The reset source is masked, cannot work
 */
#define SRC_GENERAL_SRMASK_CM7_RESET_MASK(x)     (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRMASK_CM7_RESET_MASK_SHIFT)) & SRC_GENERAL_SRMASK_CM7_RESET_MASK_MASK)

#define SRC_GENERAL_SRMASK_CM7_LOCKUP_MASK_MASK  (0x800U)
#define SRC_GENERAL_SRMASK_CM7_LOCKUP_MASK_SHIFT (11U)
/*! CM7_LOCKUP_MASK - CM7 lockup reset mask
 *  0b0..The reset source can work
 *  0b1..The reset source is masked, cannot work
 */
#define SRC_GENERAL_SRMASK_CM7_LOCKUP_MASK(x)    (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRMASK_CM7_LOCKUP_MASK_SHIFT)) & SRC_GENERAL_SRMASK_CM7_LOCKUP_MASK_MASK)

#define SRC_GENERAL_SRMASK_DCDC_OVVT_MASK_MASK   (0x1000U)
#define SRC_GENERAL_SRMASK_DCDC_OVVT_MASK_SHIFT  (12U)
/*! DCDC_OVVT_MASK - DCDC over voltage mask
 *  0b0..The reset source can work
 *  0b1..The reset source is masked, cannot work
 */
#define SRC_GENERAL_SRMASK_DCDC_OVVT_MASK(x)     (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRMASK_DCDC_OVVT_MASK_SHIFT)) & SRC_GENERAL_SRMASK_DCDC_OVVT_MASK_MASK)

#define SRC_GENERAL_SRMASK_ECAT_RSTO_MASK_MASK   (0x2000U)
#define SRC_GENERAL_SRMASK_ECAT_RSTO_MASK_SHIFT  (13U)
/*! ECAT_RSTO_MASK - ECAT reset output mask
 *  0b0..The reset source can work
 *  0b1..The reset source is masked, cannot work
 */
#define SRC_GENERAL_SRMASK_ECAT_RSTO_MASK(x)     (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRMASK_ECAT_RSTO_MASK_SHIFT)) & SRC_GENERAL_SRMASK_ECAT_RSTO_MASK_MASK)

#define SRC_GENERAL_SRMASK_WDOG1_MASK_LOCKED_MASK (0x10000U)
#define SRC_GENERAL_SRMASK_WDOG1_MASK_LOCKED_SHIFT (16U)
/*! WDOG1_MASK_LOCKED - Lock WDOG1_MASK
 *  0b0..This bit and WDOG1_MASK's value can be changed.
 *  0b1..This bit and WDOG1_MASK's value cannot be changed.
 */
#define SRC_GENERAL_SRMASK_WDOG1_MASK_LOCKED(x)  (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRMASK_WDOG1_MASK_LOCKED_SHIFT)) & SRC_GENERAL_SRMASK_WDOG1_MASK_LOCKED_MASK)

#define SRC_GENERAL_SRMASK_WDOG2_MASK_LOCKED_MASK (0x20000U)
#define SRC_GENERAL_SRMASK_WDOG2_MASK_LOCKED_SHIFT (17U)
/*! WDOG2_MASK_LOCKED - Lock WDOG2_MASK
 *  0b0..This bit and WDOG2_MASK's value can be changed.
 *  0b1..This bit and WDOG2_MASK's value cannot be changed.
 */
#define SRC_GENERAL_SRMASK_WDOG2_MASK_LOCKED(x)  (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRMASK_WDOG2_MASK_LOCKED_SHIFT)) & SRC_GENERAL_SRMASK_WDOG2_MASK_LOCKED_MASK)

#define SRC_GENERAL_SRMASK_WDOG3_MASK_LOCKED_MASK (0x40000U)
#define SRC_GENERAL_SRMASK_WDOG3_MASK_LOCKED_SHIFT (18U)
/*! WDOG3_MASK_LOCKED - Lock WDOG3_MASK
 *  0b0..This bit and WDOG3_MASK's value can be changed.
 *  0b1..This bit and WDOG3_MASK's value cannot be changed.
 */
#define SRC_GENERAL_SRMASK_WDOG3_MASK_LOCKED(x)  (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRMASK_WDOG3_MASK_LOCKED_SHIFT)) & SRC_GENERAL_SRMASK_WDOG3_MASK_LOCKED_MASK)

#define SRC_GENERAL_SRMASK_WDOG4_MASK_LOCKED_MASK (0x80000U)
#define SRC_GENERAL_SRMASK_WDOG4_MASK_LOCKED_SHIFT (19U)
/*! WDOG4_MASK_LOCKED - Lock WDOG4_MASK
 *  0b0..This bit and WDOG4_MASK's value can be changed.
 *  0b1..This bit and WDOG4_MASK's value cannot be changed.
 */
#define SRC_GENERAL_SRMASK_WDOG4_MASK_LOCKED(x)  (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRMASK_WDOG4_MASK_LOCKED_SHIFT)) & SRC_GENERAL_SRMASK_WDOG4_MASK_LOCKED_MASK)

#define SRC_GENERAL_SRMASK_WDOG5_MASK_LOCKED_MASK (0x100000U)
#define SRC_GENERAL_SRMASK_WDOG5_MASK_LOCKED_SHIFT (20U)
/*! WDOG5_MASK_LOCKED - Lock WDOG5_MASK
 *  0b0..This bit and WDOG5_MASK's value can be changed.
 *  0b1..This bit and WDOG5_MASK's value cannot be changed.
 */
#define SRC_GENERAL_SRMASK_WDOG5_MASK_LOCKED(x)  (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRMASK_WDOG5_MASK_LOCKED_SHIFT)) & SRC_GENERAL_SRMASK_WDOG5_MASK_LOCKED_MASK)

#define SRC_GENERAL_SRMASK_TEMPSENSE_MASK_LOCKED_MASK (0x200000U)
#define SRC_GENERAL_SRMASK_TEMPSENSE_MASK_LOCKED_SHIFT (21U)
/*! TEMPSENSE_MASK_LOCKED - Lock TEMPSENSE_MASK
 *  0b0..TEMPSENSE_MASK's value can be changed.
 *  0b1..This bit and TEMPSENSE_MASK's value cannot be changed.
 */
#define SRC_GENERAL_SRMASK_TEMPSENSE_MASK_LOCKED(x) (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRMASK_TEMPSENSE_MASK_LOCKED_SHIFT)) & SRC_GENERAL_SRMASK_TEMPSENSE_MASK_LOCKED_MASK)

#define SRC_GENERAL_SRMASK_EDGELOCK_MASK_LOCKED_MASK (0x400000U)
#define SRC_GENERAL_SRMASK_EDGELOCK_MASK_LOCKED_SHIFT (22U)
/*! EDGELOCK_MASK_LOCKED - Lock EDGELOCK_MASK
 *  0b0..EDGELOCK_MASK's value can be changed.
 *  0b1..This bit and EDGELOCK_MASK's value cannot be changed.
 */
#define SRC_GENERAL_SRMASK_EDGELOCK_MASK_LOCKED(x) (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRMASK_EDGELOCK_MASK_LOCKED_SHIFT)) & SRC_GENERAL_SRMASK_EDGELOCK_MASK_LOCKED_MASK)

#define SRC_GENERAL_SRMASK_JTAGSW_MASK_LOCKED_MASK (0x800000U)
#define SRC_GENERAL_SRMASK_JTAGSW_MASK_LOCKED_SHIFT (23U)
/*! JTAGSW_MASK_LOCKED - Lock JTAGSW_MASK
 *  0b0..JTAGSW_MASK's value can be changed.
 *  0b1..This bit and JTAGSW_MASK's value cannot be changed.
 */
#define SRC_GENERAL_SRMASK_JTAGSW_MASK_LOCKED(x) (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRMASK_JTAGSW_MASK_LOCKED_SHIFT)) & SRC_GENERAL_SRMASK_JTAGSW_MASK_LOCKED_MASK)

#define SRC_GENERAL_SRMASK_CM33_RESET_MASK_LOCKED_MASK (0x1000000U)
#define SRC_GENERAL_SRMASK_CM33_RESET_MASK_LOCKED_SHIFT (24U)
/*! CM33_RESET_MASK_LOCKED - Lock CM33_RESET_MASK
 *  0b0..CM33_RESET_MASK's value can be changed.
 *  0b1..This bit and CM33_RESET_MASK's value cannot be changed.
 */
#define SRC_GENERAL_SRMASK_CM33_RESET_MASK_LOCKED(x) (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRMASK_CM33_RESET_MASK_LOCKED_SHIFT)) & SRC_GENERAL_SRMASK_CM33_RESET_MASK_LOCKED_MASK)

#define SRC_GENERAL_SRMASK_CM33_LOCKUP_MASK_LOCKED_MASK (0x2000000U)
#define SRC_GENERAL_SRMASK_CM33_LOCKUP_MASK_LOCKED_SHIFT (25U)
/*! CM33_LOCKUP_MASK_LOCKED - Lock CM33_LOCKUP_MASK
 *  0b0..CM33_LOCKUP_MASK's value can be changed.
 *  0b1..This bit and CM33_LOCKUP_MASK's value cannot be changed.
 */
#define SRC_GENERAL_SRMASK_CM33_LOCKUP_MASK_LOCKED(x) (((uint32_t)(((uint32_t)(x)) << SRC_GENERAL_SRMASK_CM33_LOCKUP_MASK_LOCKED_SHIFT)) & SRC_GENERAL_SRMASK_CM33_LOCKUP_MASK_LOCKED_MASK)

